## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # helm_release.bookinfo will be created
+   resource "helm_release" "bookinfo" {
+       atomic                     = false
+       chart                      = "istio-bookinfo"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "bookinfo"
+       namespace                  = "devingress"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://evry-ace.github.io/helm-charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.2.2"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "gateway.hostname"
+           value = "wayofthesys.org"
        }
+       set {
+           name  = "gateway.selector"
+           value = "ingressgateway"
        }
+       set {
+           name  = "service.type"
+           value = "ClusterIP"
        }
    }

  # helm_release.external-dns will be updated in-place
!   resource "helm_release" "external-dns" {
        id                         = "external-dns"
        name                       = "external-dns"
        # (27 unchanged attributes hidden)

-       set {
-           name  = "domainFilters" -> null
-           value = "{wayofthesys.org}" -> null
        }
+       set {
+           name  = "domainFilters"
+           value = "{wayofthesys.org}"
        }
+       set {
+           name  = "istio-ingress-gateway"
+           value = "istio-system/istio-ingressgateway"
        }
-       set {
-           name  = "provider" -> null
-           value = "digitalocean" -> null
        }
+       set {
+           name  = "provider"
+           value = "digitalocean"
        }
-       set {
-           name  = "rbac.create" -> null
-           value = "true" -> null
        }
+       set {
+           name  = "rbac.create"
+           value = "true"
        }
-       set {
-           name  = "service.LoadBalancerIP" -> null
-           value = "159.89.242.220" -> null
        }
+       set {
+           name  = "service.LoadBalancerIP"
+           value = "159.89.242.220"
        }
-       set {
-           name  = "sources" -> null
-           value = "{ingress,service}" -> null
        }
+       set {
+           name  = "sources"
+           value = "{ingress,service}"
        }

        # (1 unchanged block hidden)
    }

  # helm_release.istio-base will be created
+   resource "helm_release" "istio-base" {
+       atomic                     = false
+       chart                      = "base"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istio-base"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.0"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.istio-egress will be created
+   resource "helm_release" "istio-egress" {
+       atomic                     = false
+       chart                      = "gateway"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istio-egressgateway"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.0"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "service.type"
+           value = "ClusterIP"
        }
    }

  # helm_release.istio-ingress will be created
+   resource "helm_release" "istio-ingress" {
+       atomic                     = false
+       chart                      = "gateway"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istio-ingressgateway"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.0"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.istiod will be created
+   resource "helm_release" "istiod" {
+       atomic                     = false
+       chart                      = "istiod"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istiod"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.0"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "grafana.enabled"
+           value = "true"
        }
+       set {
+           name  = "kiali.enabled"
+           value = "true"
        }
+       set {
+           name  = "meshConfig.accessLogFile"
+           value = "/dev/stdout"
        }
+       set {
+           name  = "servicegraph.enabled"
+           value = "true"
        }
+       set {
+           name  = "tracing.enabled"
+           value = "true"
        }
    }

Plan: 5 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
